Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: If no character is found or the string is shorter than the given index value, an empty string "" is returned, however if the given index is equal to or smaller than 0, then the first character of the string is returned.
zh_cn: 如果找不到字符或者字符串比给定的索引值短，则返回空字符串""，但是如果给定的索引等于或小于0，则返回字符串的第一个字符。

source: If no character is found or the string is shorter than the value given to index, -1 is returned.
zh_cn: 如果没有找到字符或字符串小于给定的index值，则返回-1。

source: If no instances of the object exist, the function will return the keyword noone, but if there are instances then it will return the id of the instance found.
zh_cn: 如果对象的实例不存在，此函数将返回关键字noone，但如果存在实例，则返回找到的实例的id。

source: If no name has been entered, the string "Unknown" will be returned.
zh_cn: 如果没有输入姓名，将返回字符串"未知"。

source: If no script function is assigned then the function will return -1.
zh_cn: 如果没有指定脚本函数，那么函数将返回-1。

source: If no script is assigned then the function will return -1.
zh_cn: 如果没有指定脚本，那么函数将返回-1。

source: If no such file exists, the empty string is returned.
zh_cn: 如果不存在这样的文件，则返回空字符串。

source: If no such file exists, then an empty string is returned.
zh_cn: 如果不存在这样的文件，则返回一个空字符串。

source: If no such key exists then the function will return undefined.
zh_cn: 如果不存在这样的键，那么函数将返回undefined。

source: If no tags are found or there is an error (ie: the name string given doesn't exist) then the returned array will be empty.
zh_cn: 如果没有找到标记或者有错误(例如:给定的名称字符串不存在)，那么返回的数组将为空。

source: If not specified the perpendicular to the direction of movement is used.
zh_cn: 如果未指定，则使用与移动方向垂直的方向。

source: If not, the default check is based on bounding boxes.
zh_cn: 否则，默认检查基于边界框。

source: If part_system_automatic_draw() is switched off then this function will show the particles when used in the draw event of an instance, or it can be used when the drawing target is set to a surface (using surface_set_target()) to draw the particles in the system to that surface.
zh_cn: 如果 part_system_automatic_draw() 被关闭，那么此函数在实例的绘制事件中使用时会显示粒子，或者它可以在绘制目标设置为一个表面时使用（使用surface_set_target()）将系统中的粒子绘制到那个表面。

source: If set to true the depth buffer will be disabled for created surfaces.
zh_cn: 如果设置为true，深度缓冲将被禁用创建的表面。

source: If set to true the room is considered persistent, in which case each time you leave the room and come back again the state of the instances within that room will have been maintained.
zh_cn: 如果设置为true，则该房间被认为是持久的，在这种情况下，每次您离开房间并再次回来时，该房间内实例的状态都将被保持。

source: If set to true then the element will be displayed tiled horizontally across the room, and when set to false, the element will not be tiled.
zh_cn: 如果设置为真，那么元素将横过房间平铺显示，如果设置为假，元素将不平铺。

source: If set to true then the element will be displayed tiled vertically down the room, and when set to false, the element will not be tiled.
zh_cn: 如果设置为true，则元素将显示垂直向下平铺房间，如果设置为false，则元素将不平铺。

source: If solid is set to true then, when a collision is detected, the colliding instance is returned automatically to the position it was at in the step previous to the collision (and then any code or actions are run in the collision event).
zh_cn: 如果将solid设置为true，则当检测到碰撞时，碰撞实例会自动返回到碰撞前一步中的位置(然后在碰撞事件中运行任何代码或操作)。

source: If tap counting is disabled, then the initial tap won't be registered until the double-tap time has passed and no second tap has been detected.
zh_cn: 如果点击计数被禁用，则在双击时间过去且没有检测到第二次点击之前，不会记录初始点击。

source: If the DS map that is being copied to is not empty, then this function will clear it first before copying.
zh_cn: 如果要复制到的DS map不为空，则此函数将在复制之前首先清除它。

source: If the IDE has set the animation speed for the sprite used to be calculated as Frames Per Game Frame, then the speed value given is a multiplier, with 1 being the default value, and setting it to 0.5 will half the animation speed, while setting it to 1.5 will double it.
zh_cn: 如果IDE已经为sprite设置了动画速度，该速度过去是按每游戏帧的帧数计算的，那么给定的速度值是一个乘数，默认值为1，设置为0.5将使动画速度减半，而设置为1.5将使动画速度加倍。

source: If the IDE has set the animation speed for the sprite used to be calculated as Frames Per Game Frame, then the speed value given is a multiplier, with 1 being the default value, and setting it to 0.5 will half the animation speed, while setting it to 2 will double it.
zh_cn: 如果IDE已经为sprite设置了动画速度，该速度过去是按每游戏帧的帧数计算的，那么给定的速度值是一个乘数，默认值为1，设置为0.5将使动画速度减半，而设置为2将使动画速度加倍。

source: If the array is empty, the function will return undefined.
zh_cn: 如果数组为空，函数将返回未定义。

source: If the asset is not found, the function will return a value of -1, otherwise it will return the unique index id for the asset being checked.
zh_cn: 如果未找到资源，此函数将返回-1值，否则将返回被检查资源的惟一索引id。

source: If the attachment was successfully created the function will return 1 and if it was not (you supplied an invalid sprite index, or the base sprite is not a Spine sprite) then it will return -1.
zh_cn: 如果成功创建了附件，此函数将返回1，如果没有创建(您提供了无效的精灵索引，或者基本精灵不是脊椎精灵)，则它将返回-1。

source: If the background element has no sprite attached or the sprite used has no sub-images, this function will have no effect.
zh_cn: 如果背景元素没有附加sprite或者使用的sprite没有子图像，此函数将不起作用。

source: If the data being copied exceeds the length of the destination array, the array will be extended to accept the data.
zh_cn: 如果复制的数据超过了目标数组的长度，数组将被扩展以接受数据。

source: If the decompression has failed (for example, you are supplying a buffer that hasn't been compressed) then the function will instead return a value less than 0.
zh_cn: 如果解压缩失败(例如，您正在提供一个尚未压缩的缓冲区)，那么此函数将返回一个小于0的值。

source: If the destination surface already has information this will be overwritten by the copy, and the function does not change the source surface in any way.
zh_cn: 如果目标表面已经有信息，该信息将被副本覆盖，并且此函数不会以任何方式更改源表面。

source: If the display name contains any characters that are not permitted for a file name, they will be replaced automatically with "_".
zh_cn: 如果显示名称包含任何文件名不允许的字符，它们将自动替换为"_"。

source: If the effect is anything other ef_rain or ef_snow then you can define an x/y position to create the effect, and the size can be a value of 0, 1, or 2, where 0 is small, 1 is medium and 2 is large.
zh_cn: 如果效果是ef_rain或ef_snow之外的任何东西，那么您可以定义一个x/y位置来创建效果，大小可以是值0、1或2，其中0表示小，1表示中，2表示大。

source: If the element ID given is not a valid one, then the function will return -1.
zh_cn: 如果给定的元素ID不是有效的，则函数将返回-1。

source: If the element has no sprite assigned, the function will return -1.
zh_cn: 如果元素没有指定sprite，函数将返回-1。

source: If the element is not an instance, the function will return -1.
zh_cn: 如果元素不是实例，函数将返回-1。

source: If the emitter itself is not ever going to move you would normally not need to set these values, but, for example, if you are making a scrolling shooter game where the enemies come from the right and scroll to the left, you would set this to have a velocity of (hspeed, 0, 0) in the create event of the enemies (and update the emitter of each instance in the step event using audio_emitter_position()) to give any sounds emitted by the enemy instances the correct Doppler as they pass the player instance (which in turn would be using the function audio_listener_position() to set the listener to the correct position).
zh_cn: 如果发射器本身不会移动，你通常不需要设置这些值，但是，例如，如果你在制作一款卷轴射击游戏，敌人从右边来，向左滚动，你可以将其速度设置为(hspeed, 0,0)在敌人的创建事件中(并在步骤事件中使用audio_emitter_position()更新每个实例的发射器)，以在敌人实例通过播放器实例时为其发出的任何声音提供正确的多普勒(这将依次使用函数audio_listener_position()将侦听器设置到正确的位置)。

source: If the file already contains information, this information will be erased and the string will be written at the beginning of the file, unless you have opened the file with the file_text_open_append().
zh_cn: 如果文件已经包含信息，则该信息将被擦除，字符串将写入文件的开头，除非您已经使用file_text_open_append()打开了文件。

source: If the file does not exists then the function will return the value -1.
zh_cn: 如果文件不存在，函数将返回值-1。

source: If the function fails - ie: an invalid group is given, or the group has no texture assigned to it - then the array will be empty (0 length).
zh_cn: 如果函数失败-例如:一个无效的组，或组没有分配给它的纹理-那么数组将为空(长度为0)。

source: If the function fails, -1 is returned.
zh_cn: 如果函数失败，则返回-1。

source: If the function returns false (ie: the audio context status is not running), then only unstreamed sounds may play (but it's not guaranteed, and you should assume that no audio can be played), while if it returns true then all audio will play.
zh_cn: 如果此函数返回false(即:音频上下文状态未运行)，则可能只播放未流式播放的声音(但这并不保证，您应该假设没有音频可以播放)，而如果它返回true，则所有音频都将播放。

source: If the given key contains a DS list ID, then the function will return true otherwise it will return false.
zh_cn: 如果给定的键包含DS列表ID，那么函数将返回true，否则将返回false。

source: If the given key contains a DS map ID, then the function will return true otherwise it will return false.
zh_cn: 如果给定的键包含DS map ID，那么函数将返回true，否则将返回false。

source: If the given key does not exist then it will be created for you, and if it does then the current value will be replaced with the new value.
zh_cn: 如果给定的键不存在，则会为您创建它，如果存在，则会用新值替换当前值。

source: If the given position contains a DS list ID, then the function will return true otherwise it will return false.
zh_cn: 如果给定位置包含DS列表ID，那么函数将返回true，否则将返回false。

source: If the given position contains a DS map ID, then the function will return true otherwise it will return false.
zh_cn: 如果给定的位置包含一个DS map ID，那么函数将返回true，否则将返回false。

source: If the given tilemap ID is incorrect or the tilemap doesn't exist, the function will return -1.
zh_cn: 如果给定的tilemapID不正确或tilemap不存在，此函数将返回-1。

source: If the global variable does not exist already in the game it will be created and then assigned the value.
zh_cn: 如果全局变量在游戏中还不存在，它将被创建并分配值。

source: If the grid size is larger than the current grid, the new cells will have a base value of 0, and if the size is smaller then the values held in the cells that are no longer within the new size will be lost.
zh_cn: 如果网格大小大于当前网格，则新单元格的基值将为0，如果网格大小较小，则不再属于新大小的单元格中保存的值将丢失。

source: If the information is not available, it will hold simply an empty string "", or "en" for "English" language.
zh_cn: 如果信息不可用，它将只包含一个空字符串""，或"en"表示"English"语言。

source: If the information is not available, it will hold simply an empty string "".
zh_cn: 如果信息不可用，它将只保存一个空字符串" "。

source: If the ini_file does not exist at the location you are checking, GameMaker may create one, but only if you write data to it.
zh_cn: 如果ini_file不存在于您正在检查的位置，GameMaker可能会创建一个，但前提是您向其中写入数据。

source: If the instance has no path assigned, the variable will be set to -1.
zh_cn: 如果实例没有分配路径，变量将被设置为-1。

source: If the instance is being controlled by a sequence, this variable will hold the sequence instance struct for the Sequence controlling the instance, otherwise it will be undefined. This is a read-only variable and cannot be changed.
zh_cn: 如果实例由序列控制，此变量将保存控制该实例的sequence的序列实例结构，否则将为未定义。这是一个只读变量，不能更改。

source: If the instance is being controlled by a sequence, this variable will return true, otherwise it will return false. This is a read-only variable and cannot be changed.
zh_cn: 如果实例由序列控制，该变量将返回true，否则将返回false。这是一个只读变量，不能更改。

source: If the keyboard is not visible, 0 will be returned.
zh_cn: 如果键盘不可见，将返回0。

source: If the layer assigned has instances added to it, then the shader will be applied to all the draw events that the instance uses - for example if the instance has a Draw GUI Begin event, then the shader will be applied automatically to it.
zh_cn: 如果分配的层有实例添加到它，那么着色器将应用到实例使用的所有绘制事件-例如，如果实例有一个绘制GUI开始事件，那么着色器将自动应用到它。

source: If the layer is not one of the room editor ones (ie: it was created using layer_create()) then an empty string will be returned.
zh_cn: 如果该层不是房间编辑器的层之一(即:它是使用layer_create()创建的)，那么将返回一个空字符串。

source: If the layer is one that has been designed in the room editor, then the next time you leave the room and then return, the layer will be recreated again with the original contents, however if the room is persistent, the layer will be removed unless room persistence is switched off again.
zh_cn: 如果该层是在房间编辑器中设计的，那么下次您离开房间并返回时，该层将使用原始内容重新创建，但是如果房间是持久的，则该层将被删除，除非再次关闭房间持久性。

source: If the list contains strings, these will be sorted alphabetically, based on the English 26 letter alphabet.
zh_cn: 如果列表包含字符串，则这些字符串将根据英文26个字母进行字母排序。

source: If the listener itself is not ever going to move, or the movement is not a constant motion, you would normally not need to set these values, but, for example, if you are making a scrolling game where the player has a constant bottom to top movement and the enemies a constant top to bottom movement, you would set the listener and emitter velocities (for emitters you would use audio_emitter_velocity()) to the appropriate vectors to simulate the correct Doppler effect as they move past the player instance.
zh_cn: 如果侦听器本身不会移动，或者移动不是恒定的移动，你通常就不需要设置这些值，但是，例如，如果你在制作一款滚动游戏，其中玩家的移动是恒定的从下到上，敌人的移动是恒定的从上到下，你可以设置和发射器的速度(对于发射器，你可以使用audio_emitter_velocity())到适当的矢量，以模拟正确的多普勒效应，因为它们经过播放器实例。

source: If the load fails for whatever reason, the function will return -1 and a message will be shown in the compiler output window saying that the load has failed.
zh_cn: 如果加载因任何原因失败，函数将返回-1，并且编译器输出窗口中将显示一条消息，说明加载失败。

source: If the map that the string is being read into contains any key/value pairs, these will be cleared first before the saved map is re-constructed.
zh_cn: 如果字符串读入的映射包含任何键/值对，那么在重新构建保存的映射之前，将首先清除这些键/值对。

source: If the method was not defined in a script then the function will return -1, otherwise it will return the index value for the script.
zh_cn: 如果方法没有在脚本中定义，那么函数将返回-1，否则将返回脚本的索引值。

source: If the number of places specified is greater than the value to be shown and/or the number plus the decimal places that have been specified is less than the total places, then spaces will be added before the value to make up the difference (see the example below).
zh_cn: 如果指定的位数大于要显示的值和/或数字加上已指定的小数点位数小于总位数，那么将在值之前添加空格以弥补差额(参见下面的示例)。

source: If the object has reached the end of a path it is following
zh_cn: 如果对象已经到达了它所遵循的路径的尽头

source: If the object's sprite has reached the end of its animation
zh_cn: 如果对象的精灵已经到达其动画的结尾

source: If the player id argument is not given, the preferences for the local player will be returned.
zh_cn: 如果没有给定玩家id参数，将返回本地玩家的首选项。

source: If the point falls within the defined circle the function will return true otherwise the function will return false.
zh_cn: 如果该点落在定义的圆内，此函数将返回true，否则此函数将返回false。

source: If the point falls within the defined rectangle the function will return true otherwise the function will return false.
zh_cn: 如果该点落在定义的矩形内，函数将返回true，否则函数将返回false。

source: If the point falls within the defined triangle the function will return true otherwise the function will return false.
zh_cn: 如果该点落在定义的三角形内，此函数将返回true，否则此函数将返回false。

source: If the point is outside of the range of the path (ie: a path has 8 points and you ask for the x position of point 10) then a value of 0 will be returned.
zh_cn: 如果这个点在路径的范围之外(例如:路径有8个点，而你要求得到点10的x位置)，那么返回值为0。

source: If the point is outside of the range of the path (ie: a path has 8 points and you ask for the y position of point 10) then a value of 0 will be returned.
zh_cn: 如果这个点在路径的范围之外(例如:路径有8个点，而你要求得到点10的y位置)，那么返回值为0。

source: If the queue is empty then the function will return the constant undefined, otherwise it will return the real or string value contained in the queue.
zh_cn: 如果队列为空，那么函数将返回常量undefined，否则将返回队列中包含的实数或字符串值。

source: If the real number is an integer, it will be saved with no decimal places, otherwise, it will be saved with two decimal places.
zh_cn: 如果实数是整数，则保存时不带小数位，否则保存时带两位小数位。

source: If the rectangle is filled, then the colour arguments will be used to generate a colour gradient from the centre to the edges, where colour 1 is the centre colour and colour 2 the edge colour.
zh_cn: 如果矩形被填充，那么颜色参数将用于生成从中心到边缘的颜色渐变，其中颜色1是中心颜色，颜色2是边缘颜色。

source: If the scheduler's resolution is set to the default value (as set by Windows), the function will return -1.
zh_cn: 如果计划程序的分辨率设置为默认值(由Windows设置)，此函数将返回-1。

source: If the service is not available, the user is logged into a "pretend" game centre and all achievements and scores are stored on the device so that when the actual service is available, these details can be uploaded.
zh_cn: 如果服务不可用，用户就会登录到一个"虚拟"游戏中心，所有的成就和分数都存储在设备上，这样当真正的服务可用时，这些细节就可以上传了。

source: If the sprite is animated, then you can get the current frame of the animation by checking the image_index variable, or if you want to change the state of a static sprite, you can select a new sub-image by setting this variable to the desired sub-image of the sprite.
zh_cn: 如果精灵是动画，那么你可以通过检查image_index变量来获得动画的当前帧，或者如果你想改变静态精灵的状态，你可以通过设置这个变量来选择一个新的子图像。

source: If the sprite used has no sub-images, this function will have no effect.
zh_cn: 如果使用的精灵没有子图像，此函数将没有效果。

source: If the sprite used has no sub-images, this variable will have no effect.
zh_cn: 如果使用的精灵没有子图像，这个变量将没有效果。

source: If the stack is empty then the function will return the constant undefined, otherwise it will return the real or string value contained in the stack.
zh_cn: 如果堆栈为空，那么函数将返回常量undefined，否则将返回堆栈中包含的实数或字符串值。

source: If the system is not flagged as persistent then it will be automatically destroyed at the end of the room it was created in (this is the same as if you had called the function part_system_destroy() and will also destroy any emitters associated with the system).
zh_cn: 如果系统没有被标记为持久的，那么它将在创建它的房间的末尾自动销毁(这与调用函数part_system_destroy()是一样的，并且还将销毁与系统相关的任何发射器)。

source: If the time line was created dynamically using the timeline_add() function, then this function should be used the moment that the time line is no longer needed to prevent any memory leaks that could slow down (and eventually crash) your game.
zh_cn: 如果时间线是使用timeline_add()函数动态创建的，那么应该在不再需要使用此时间线的时候删除，以防止任何可能降低游戏速度(并最终导致游戏崩溃)的内存泄漏。

source: If the user presses "Cancel" an empty string "" is returned.
zh_cn: 如果用户按"取消"，则返回空字符串""。

source: If the value being searched for does not exist, then the function will return -1.
zh_cn: 如果要搜索的值不存在，那么函数将返回-1。

source: If the value does not exist in the priority queue then undefined will be returned.
zh_cn: 如果该值在优先级队列中不存在，则将返回undefined。

source: If the value is larger than the number of sub-images, then GameMaker will automatically loop the number to select the corresponding image (for example, if the sprite being drawn has 5 sub-images numbered 0 to 4 and we set the index value to 7, then the function will draw sub-image 3, numbered 0).
zh_cn: 如果该值大于子图的数量，那么 GameMaker 会自动循环该数字来选择对应的图像（例如，如果正在绘制的精灵有 5 个子图，编号为 0 到 4，我们将索引值设置为7、然后函数会绘制子图3，编号为0）。

source: If the value is not found the function returns -1.
zh_cn: 如果没有找到该值，则函数返回-1。

source: If the variable does not exist already in the instance it will be created and then assigned the value.
zh_cn: 如果该变量在实例中不存在，则将创建该变量，然后为其赋值。

source: If the variable does not exist already in the struct it will be created and then assigned the value.
zh_cn: 如果该变量在结构中不存在，将创建该变量，然后为其赋值。

source: If the variable is not a method then the function will return undefined.
zh_cn: 如果变量不是方法，则函数将返回未定义。

source: If there are no assets with the given tag(s), or if there is an error (eg: the given tags do not exist), then an empty array will be returned.
zh_cn: 如果没有具有给定标签的资源，或者如果有错误(例如:给定标签不存在)，那么将返回一个空数组。

source: If there are no layers at the given depth then the array will have a single entry at the [0] position with a value of -1, but, if there are layers at the depth, then an entry will be made in the array for each layer found - the entry value will be the unique ID value for a layer.
zh_cn: 如果在给定的深度上没有层，那么数组将在[0]位置上有一个值为-1的单一条目，但是，如果在深度上有层，那么将为找到的每个层在数组中创建一个条目—条目值将是一个层的唯一ID值。

source: If there is no room after the one you input then -1 is returned. Note that this function will not recognise or take into consideration rooms that have been added dynamically using room_add() or room_duplicate().
zh_cn: 如果在您输入的空格之后没有空格，则返回-1。注意，此函数不会识别或考虑使用room_add()或room_duplicate()动态添加的房间。

source: If there is no room before the one you input then -1 is returned.
zh_cn: 如果在您输入的空间之前没有空间，则返回-1。

source: If these colours are not the same, you will get a gradient effect from one to the other (the colour settings will over-ride the base colour set with the function draw_set_colour()).
zh_cn: 如果这些颜色不相同，您将得到从一个到另一个的渐变效果(颜色设置将使用draw_set_color()函数覆盖基本颜色设置)。

source: If these colours are not the same, you will get a gradient effect from one to the other and the colour settings will over-ride the base colour set with the function draw_set_colour().
zh_cn: 如果这些颜色不相同，你将得到从一个到另一个的渐变效果，颜色设置将使用draw_set_color()函数覆盖基础颜色设置。

source: If they are not touching at all the function will return 0, if the source is completely within the destination it will return 1, and if they are simply overlapping then it will return 2.
zh_cn: 如果它们完全不接触，函数将返回0，如果源完全在目的地内，函数将返回1，如果它们只是重叠，函数将返回2。

source: If this check leads to a collision then it starts looking at directions more to the left and to the right of the ideal, straight-line direction.
zh_cn: 如果此检查导致碰撞，则它开始查看更偏向于理想直线方向的左侧和右侧的方向。

source: If this is disabled (false) then images will be drawn based on the nearest pixel when scaled or moving which may lead to "blocky" images.
zh_cn: 如果禁用(false)，那么当缩放或移动时，图像将基于最近的像素绘制，这可能导致"块状"图像。

source: If this is not what you require, then you should use a function like path_duplicate() to create a copy of the path first, then call this function on the duplicated asset (don't forget to call path_delete() on the asset when it is no longer required).
zh_cn: 如果这不是您所需要的，那么您应该首先使用一个类似path_duplicate()的函数来创建路径的副本，然后在复制的资源上调用此函数(不要忘记在不再需要它时在资源上调用path_delete())。

source: If this is set to true, no external force (either from coded impulses or forces, or from collisions) will affect the rotation value of the instance and this would have to be set manually using the phy_rotation variable
zh_cn: 如果设置为true，没有外力(来自编码的脉冲或力，或来自碰撞)会影响实例的旋转值，这必须使用phy_rotation变量手动设置

source: If this is switched on, the bounding box and the precise collision mask will be drawn as outlines around the sprite.
zh_cn: 如果启用此选项，边界框和精确碰撞遮罩将被绘制为精灵周围的轮廓。

source: If this path has been created dynamically using path_add(), the variable that holds the path index will no longer be valid for accessing the path as it no longer exists, and if the path was created using the Path Editor that path can no longer be accessed in the whole game as you are permanently deleting it.
zh_cn: 如果这个路径是使用path_add()动态创建的，那么保存路径索引的变量将不再有效，因为它已经不存在了，如果这个路径是使用路径编辑器创建的，那么这个路径在整个游戏中就不能再被访问了，因为你已经永久删除了它。

source: If this room does not exist, an error will be thrown and the game will be forced to close.
zh_cn: 如果这个房间不存在，将抛出一个错误，游戏将被迫关闭。

source: If true, col1 is irrelevant.
zh_cn: 如果为真，col1是无关的。

source: If true, enables a debug view
zh_cn: 如果为true，则启用调试视图

source: If used on a path from the Asset Browser, note that the function will change the actual asset, and so will permanently affect how the path is used by all instances in the game from the moment the function is used until the end of the game.
zh_cn: 如果在来自资源浏览器的路径上使用此函数，注意此函数将改变实际的资源，因此将永久地影响游戏中所有实例使用该路径的方式(从此函数使用到游戏结束)。

source: If you are checking an analogue button, then the check will take into consideration the threshold setting and only return true while the raw input value is over the given threshold (you can get this raw value using the function gamepad_button_value()).
zh_cn: 如果您正在检查一个模拟按钮，那么该检查将考虑阈值设置，并且只在原始输入值超过给定阈值时返回true(您可以使用函数gamepad_button_value()获得这个原始值)。

source: If you are copying a file on Android from within your Included Files area (which will be inside your APK) it will copy into memory first, so, be aware that copying very large files from the APK may cause devices to run out of memory.
zh_cn: 如果你在Android上从你的包含文件区(将在你的APK中)复制一个文件，它将首先复制到内存中，所以，注意，从APK复制非常大的文件可能会导致设备内存不足。

source: If you are not sure of the contents of the JSON, you can use the different Variable Functions (like typeof() or variable_struct_get_names()) to check the returned contents.
zh_cn: 如果不确定JSON的内容，可以使用不同的变量函数(如typeof()或variable_struct_get_names())来检查返回的内容。
